README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Voalte REST API</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-03-08 00:10:06 EST"/>
<meta name="author" content="Justin Kirby <jkirby@voalte.com>"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Voalte REST API</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 hooks api </a>
<ul>
<li><a href="#sec-1_1">1.1 verify_pre </a></li>
<li><a href="#sec-1_2">1.2 verify_post </a></li>
<li><a href="#sec-1_3">1.3 install_pre </a>
<ul>
<li><a href="#sec-1_3_1">1.3.1 sh </a></li>
</ul>
</li>
<li><a href="#sec-1_4">1.4 install_post </a>
<ul>
<li><a href="#sec-1_4_1">1.4.1 sh </a></li>
<li><a href="#sec-1_4_2">1.4.2 erl </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> hooks api </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> verify_pre </h3>
<div class="outline-text-3" id="text-1_1">

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> verify_post </h3>
<div class="outline-text-3" id="text-1_2">

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> install_pre </h3>
<div class="outline-text-3" id="text-1_3">

<p>   This hook will be called before any install steps have been
   started. This means the release tarball exists in a temporary
   directory.
</p>
</div>

<div id="outline-container-1_3_1" class="outline-4">
<h4 id="sec-1_3_1"><span class="section-number-4">1.3.1</span> sh </h4>
<div class="outline-text-4" id="text-1_3_1">

<p>    the file must be lib/app-vsn/priv/ibeam_hooks/install_pre.sh
</p>
<p>
    The sh script will be called with the following arguments:
</p><ul>
<li>tmp_dir
</li>
<li>app name,  foo
</li>
<li>vsn,  1.2.3
</li>
</ul>

<p>
    The tmp_dir is the path that verify step extracted the release
    tarball in. ex: /tmp/ibeam_
</p>
</div>
</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> install_post </h3>
<div class="outline-text-3" id="text-1_4">

<p>   This hook will be called after <b>all</b> install steps have completed. 
</p>

</div>

<div id="outline-container-1_4_1" class="outline-4">
<h4 id="sec-1_4_1"><span class="section-number-4">1.4.1</span> sh </h4>
<div class="outline-text-4" id="text-1_4_1">

<p>    the file must be lib/app-vsn/priv/ibeam_hooks/install_post.sh
</p>
<p>
    The sh script will be called with the following arguments:
</p><ul>
<li>code:lib_dir()
</li>
<li>app name,  foo
</li>
<li>vsn,  1.2.3
</li>
</ul>
    Example:



<pre class="src src-sh">lib/app-vsn/priv/ibeam_hooks/install_post.sh <span style="color: #ad7fa8;">\</span>
   /path/to/lib/erlang/lib <span style="color: #ad7fa8;">\</span>
   foo 1.2.3
</pre>




</div>

</div>

<div id="outline-container-1_4_2" class="outline-4">
<h4 id="sec-1_4_2"><span class="section-number-4">1.4.2</span> erl </h4>
<div class="outline-text-4" id="text-1_4_2">

<p>    the file must be lib/app-vsn/priv/ibeam_hooks/install_post.erl
</p>
<p>
    This file will be compiled and loaded into the ibeam
    environment. Thus, it will have access to all functions of ibeam
    modules. Most notably:
</p><ul>
<li>ibeam_config
</li>
<li>ibeam_utils
</li>
<li>ibeam_file_utils
</li>
</ul>

<p>
    The values in the list of args is the same as what is passed to
    the sh.
</p>



<pre class="src src-erlang">Mod:<span style="font-weight: bold;">hook</span>([<span style="font-weight: bold;">code</span>:<span style="font-weight: bold;">lib_dir</span>(),<span style="color: #ad7fa8;">"foo"</span>,<span style="color: #ad7fa8;">"1.2.3"</span>]).
</pre>



</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author">Author: Justin Kirby <jkirby@voalte.com></p>
<p class="creator">Org version 7.4 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
